package abc.pra;

public class Ex11 {
	public static void main(String[] args) {
		//1.  이름이 홍길동인 사람의 점수가
		// 국어 90, 영어 80, 수학 80 이다.
		// 총점과 평균을 구하자.
		// 출력은 이름, 총점, 평균만 출력하자.(단, 평균은 소수점 첫째자리 까지 구하자)
		
		
		
		
		// 2.  2시간 40분 30초를 초로 환산하여라 (몇 초일까요?)
		
		
		//3. 3989초는 몇 시간 몇 분 몇 초 일까요?
		
		
		
		// 4. 카페모카 6500원이다.
				// 친구와 둘이서 15000원을 내고 주문했다.
				// 잔돈은 얼마인가? (단, 부가세 10% 포함)
		
		
		//5.  이름, 국어, 영어, 수학 점수를 키보드로 받아서
		// 총점과 평균을 구하자.
		// 출력은 이름, 총점, 평균만 출력하자.(단, 평균은 소수점 둘째자리 까지 구하자)
		
		//키보드로 정보를 입력 받자.
		
		
		//6. 		// int k1 이 홀수인지 짝수인지 판별하자 (삼항연산자 사용)
		// 힌트 ) 어떤 수를 2로 나눈 나머지가 0이면 짝수, 1이면 홀수
		
		
		//7.  //int k2가 60 이상이면 합격, 아니면 불합격 (삼항연산자 사용)
		
		
		//8. 	 // k3가 1이면 1000원짜리에 0.1 할인 한다 0.1 할인 한다.(얼마에 살 수 있나?) (삼항연산자 사용)
		
		
		//9. 		 //char k4 = 대문자 인지 대문자가 아닌지 판별하자(삼항연산자 사용)
		
		
		//10. 		 // 근무시간이 8시간 까지는 시간당 9860 이고
		 // 8시간 초과한 시간 만큼은 1.5배 지급한다.
		 // 현재 근무한 시간이 10시간 이다.
		 // 얼마를 받아야 하는가?           (삼항연산자 사용)
		
		
		
		//11. 		//k1이 홀수 짝수 인지 판별 (k1의 값을 키보드로 받아서 삼항연산자 사용하여 판별하기)
		
		
		//12. 	// 받은 점수가 60점 이상이면 합격 아니면 불합격(값을 키보드로 받아서 삼항연산자 사용하여 판별하기)
		
		
		
		//13. 	// int k1이 90이상이면 "A학점", 80이상이면"B학점", 나머지는 "F학점" (삼항연산자 사용)
		
		
		
		//14. // char k2가 대문자인지, 소문자인지, 기타문자인지 판별하자(삼항연산자 사용)

		
		// 15. int k3가 1 또는 3이면 남자, 나머지 여자(삼항연산자 사용)

		
		// 16. int k4가 1 또는 3이면 남자, 2 또는 4면 여자, 나머지 외계인 (삼항연산자 사용)
	
		
		//  17.  int k5 = 1이면 1900년대 태어난 남자, 3이면 2000년대 태어난 남자
		// 				 2이면 1900년대 태어난 여자, 4이면 2000년대 태어난 여자, 나머지 외계인 (삼항연산자 사용)
		
		
		
		// 18. 두 수 중 큰 수를 구하자 (su1=4, su2 = 9) (math 메서드 사용)
		
		
		//19. 	// int k1이 60 이상 합격 (if 문 사용)
			int k1 = 80;
			String result1 = "불합격";
			if (k1>=60) {
				 result1 = "합격";
			}
			System.out.println("결과는 "+result1);
		
		
		// 20. int k2가 60이상이면 합격, 60 미만이면 불합격  (if 문 사용)
				int k2 = 70;
				String result2 = "";
				if (k2>=60) {
					result2 = "합격";
				}else if (k2<=60) {
					result2 = "불합격";
				}
				System.out.println("결과는 "+result2);
			
				// 21. int k3가 60이상이면 합격, 60 미만이면 불합격  (if 문 사용)
					int k3 = 80;
				
				
		
		// 22. int k4 이 홀수인지 짝수인지 판별하자								(if 문 사용)
				// 힌트) 어떤 수를 2 나눈 나머지가 0 이면 짝수, 1이면 홀수
				int k4 = 6;
				String result4 = "";
				if (k4%2==0) {
					result4 = "짝수";
				}
				
					
					
				// 23. int k2 가 60 이상이면 합격 아니면 불합격 (if 문 사용)
				
				
				// 24. 	k3이 1이면 가격에 0.1 할인(10%) 한다.(얼마에 살 수 있나) (if 문 사용)
				
						
				//25. 	char k4 = 대문자인지, 대문자가 아닌지 판별하자. (if 문 사용)
				
				
				// 26. 근무시간이 8시간 까지는 시간당 9860이고
				// 8시간 초과한 시간 만큼은 1.5배 지급한다.
				// 현재 근무한 시간이 10시간 이다.
				// 얼마를 받아야 하는가?  							(if 문 사용)
		
		
		// 27. int k1의 점수가 90 이상이면 A, 80이상이면 B, 70이상이면 C, 나머지 F 	(if 문 사용)
		

	//28.  char k2가 대문자인지, 소문자인지, 숫자인지,  나머지 기타문자인지 판별 (if 문 사용)
		

	// 29. char k3가 A 또는 a이면 아프리카, B 또는 b이면 브라질, C 또는 c 이면 캐나다, 나머지 한국 (if 문 사용)
		
		
	// 30 .menu가 1이면 카페모카 3500, 2이면 카페라떼 4000, 3이면 아메리카노 3000, 4이면 과일쥬스 3500이다.
	// 친구와 2잔을 10000 내고 먹었다. 잔돈은 얼마인가? (단 부가세 10% 포함, 친구와 같은 음료만 선택 가능) (if 문 사용)
		
		
		
		// 31. int k1 = 1이면 카페모카, 2이면 카페라떼, 3이면 아메리카노, 4이면 과일 쥬스 (switch문 사용)
				
				
				
				 
				//32.  char k2가 A면 아프리카. B면 브라질, C면 캐나다, 나머지 한국 (switch문 사용)
				
					
				
					// 33. char k3가 A이거나 a 이면 아프리카,  B 또는 b면 브라질, C 또는 c 면 캐나다, 나머지 한국 (switch문 사용)
					
				
					
					// 34. char k4가 A이거나 a 이면 아프리카,  B 또는 b면 브라질, C 또는 c 면 캐나다, 나머지 한국 (switch문 사용)
					
					
				
					// 35. String k5이 한국이면 서울, 중국이면 베이징, 일본이면 도쿄, 미국이면 워싱턴 (switch문 사용)
		
		
		
		// 36. 10~20 까지 출력 (for문 사용)
				
				
					// 37. 10~20 까지 짝수만 출력 (for문 사용)
				
					
					// 38. 10~20 까지 홀수만 출력 (for문 사용)
			
				
					
					// 39. 5단 출력 (for문 사용)
					
					
					// 0 0 0 0
					// 0 0 0 0
					// 0 0 0 0
					// 0 0 0 0  출력 (for문 사용)
					
					
					//40-1) 0 0 0 0 을 하나로 보는방법 (for문 사용)
					
				
					
					// 40-2) 0을 하나로 볼 때 (for문 사용)
					
					
					// 41. 0~10 의 누적합(합계 구하기) (for문 사용)
				
					
					// 42. 0~10 홀수의 합계와 짝수의 합계를 각각 구하자 (for문 사용)
				
					
					//		43 . 7! (7 * 6 * 5 * 4 * 3 * 2 * 1)의 합은? (for문 사용)
		
		
		
		
		
		
		
		
		
		
		
		
	}
}
